{
    "id": "nry8zg",
    "title": "First release of Hoard dotfile manager",
    "selftext": "Hi everyone! I'm excited to announce the first release of a project I've been working on for a while now called Hoard.\n\n# What is Hoard?\n\nHoard is a program that backs up sparse files from across your filesystem into a single location and can later restore them. Some of you might know programs like this as \"dotfile managers,\" like [RCM](https://github.com/thoughtbot/rcm) and [Chezmoi](https://www.chezmoi.io/).\n\nWhere Hoard is different, aside from being written in Rust, is that it is based around a configuration file. Where both RCM and Chezmoi recreate your home folder's file structure when you add files, Hoard organizes files based on the names of Hoards and Piles in those Hoards.\n\n(See more on terminology [here](https://github.com/Shadow53/hoard#terminology))\n\n# History\n\nHoard originally started out as a program for synchronizing save files for games that don't support cloud saves. I realized it was very close to a dotfile manager, so I made it more generic for those sorts of workflows.\n\n# Example\n\nWhere Hoard's power shines is how it can treat multiple paths as potential sources for those files depending on the system configuration. My favorite example for this is Vim and Neovim on Windows and Linux. The configuration file looks like this:\n\n    # Neovim is mutually exclusive with Vim, prefer Neovim\n    exclusivity = [\n        [\"neovim\", \"vim\"]\n    ]\n    \n    # Define environments\n    [envs.neovim]\n        # Detect \"neovim\" if AT LEAST one of `nvim` or `nvim-qt` exists in $PATH.\n        # This is parsed as `nvim OR nvim-qt`.\n        exe_exists = [\"nvim\", \"nvim-qt\"]\n    [envs.vim]\n        # Detect \"vim\" if AT LEAST one of `vim` or `gvim` exists in $PATH.\n        exe_exists = [\"vim\", \"gvim\"]\n    [envs.windows]\n        os = [\"windows\"]\n    [envs.linux]\n        os = [\"linux\"]\n    \n    # Define the Vim hoard\n    [hoards.vim]\n        # The init file \"pile\"\n        [hoards.vim.init]\n            # Match linux AND neovim environments\n            \"linux|neovim\" = \"/home/shadow53/.config/nvim/init.vim\"\n            \"linux|vim\" = \"/home/shadow53/.vimrc\"\n            \"windows|neovim\" = \"C:\\\\Users\\\\Shadow53\\\\AppData\\\\Local\\\\nvim\\\\init.vim\"\n            \"windows|vim\" = \"C:\\\\Users\\\\Shadow53\\\\.vim\\\\_vimrc\"\n        # The config directory \"pile\"\n        [hoards.vim.configdir]\n            \"windows|neovim\" = \"C:\\\\Users\\\\Shadow53\\\\AppData\\\\Local\\\\nvim\\\\config\"\n            \"windows|vim\" = \"C:\\\\Users\\\\Shadow53\\\\.vim\\\\config\"\n            \"linux|neovim\" = \"/home/shadow53/.config/nvim/config\"\n            \"linux|vim\" = \"/home/shadow53/.vim/config\"\n\nWith this configuration file, if I run `hoard restore vim` on my Fedora Workstation with both Vim and Neovim installed, it will copy files from the hoard to the appropriate locations for Neovim (because it takes preference to Vim) on Linux.\n\n# Current status\n\nYou can find a usage overview in the [README](https://github.com/Shadow53/hoard/blob/main/README.md), which does a decent job describing what features exist, including stuff not described here.\n\nYou can also check the [issues page](https://github.com/Shadow53/hoard/issues) for issues I've opened, primarily for keeping track of features I want to add, including:\n\n- (A)symmetric encryption of files\n- Commands to check for differences between hoards and the filesystem\n- A way to keep track of whether something got updated on a remote machine\n  - This is to help prevent overwriting changes on backup/restore and allow scripting for automatically applying new versions of files.\n\n# Thoughts?\n\nIf this sounds at all interesting to you, please try it out! You can install it with `cargo install hoard`. If you have questions, leave them below and I will get to them. If you find any bugs *not already listed on the issue tracker*, please create a bug report so I can fix it."
}